Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བཞི་ཁྲི་ཡིན། །
en: The lifespan of humans will be forty thousand years,

source: མི་ཡི་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་གནས། །
en: “And when this supreme human has attained nirvāṇa His sacred Dharma will remain complete for sixty-six thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་གཅིག །རིན་ཆེན་བརྒྱ་སྙེད་དག་གི་དྲ་བས་སྤྲས། །
en: The stūpa containing his relics will measure one league And be adorned with nets of hundreds of jewels.

source: སངས་རྒྱས་དྲག་ཤུལ་ཅན་གྱིས་བྱིན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དཀའ་ཐུབ་དྲག་ཅེས་བྱ། །
en: “The buddha Ugradatta Will be born in a place called Intense Austerities.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་སྤོས་བཟངས་ཡིན། །གསེར་འོད་རྒྱལ་བའི་ཡུམ་ཡིན་སྲས་པོ་ནི། །དཔལ་ལྡན་ཤིན་ཏུ་དཔལ་ལྡན་རིམ་གྲོ་པ། །
en: The family of this victor will be brahmin, And his light will extend one hundred leagues. “Fine Incense will be his father and Golden Light will be this victor’s mother. Glorious will be his son and Extremely Glorious his attendant.

source: ཡོན་ཏན་ཡིད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Mind of Qualities will be the scholar

source: ཡོན་ཏན་མཐོན་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And High Qualities the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་ལྔ་ཡིན་ཏེ། །
en: “There will be five consecutive congregations,

source: གཏན་པ་ལྟ་བུར་ལེགས་པར་གནས་པ་པོ། །བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཅུ་ཚོགས་པར་འགྱུར། །
en: Each of them gathering one hundred billion Who abide firmly, like bolts.

source: སྐུ་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་བརྒྱད་སྟོང་ཡིན། །
en: His lifespan will be twenty-eight thousand years,

source: འཇིག་རྟེན་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་དགུ་གནས་པར་འགྱུར། །
en: “And for the benefit of the world his sacred Dharma Will remain complete for nineteen thousand years.

source: མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་ཕྲག་གསུམ་སྟེ། །ལྷ་ཡི་སྐྱེད་མོས་ཚལ་སྙོམས་པ་ཡིས་བསྐོར། །
en: The stūpas will number three billion And be surrounded by heavenly parks.

source: སྐྱེས་བུ་དམ་པ་ཆོས་ཀྱི་དབང་ཕྱུག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཕྱག་བྱས་མཆོད་ཅེས་བྱ། །
en: “The holy being Dharmeśvara Will be born in a place called Venerated with Prostrations.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་ལྔ་ཡབ་ནི་ལེགས་མཆོད་ཡིན། །གྲགས་པའི་ཚོགས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend seventy-five leagues. “Excellent Worship will be his father and Famed Gathering will be this victor’s mother.

source: སྲས་པོ་མེ་ཏོག་མཆོད་ལེགས་རིམ་གྲོ་པ། །
en: Flower will be his son and Worship of Excellence his attendant.

source: འོད་ཀྱི་ཏོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Light Crest will be the scholar

source: ཏོག་གི་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Crest of Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་གསུམ་སྟེ་ཀུན་ལ་ཡང་། །སྲས་མཆོག་སློབ་པ་མེད་པར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཁྲི་ཉི་ཁྲི་ཡོད། །
en: “There will be three consecutive congregations, Each of them gathering two hundred billion Supreme sons who have reached the level of no more training.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་ཆིག་སྟོང་ཡིན། །
en: The lifespan of humans will be seventy-one thousand years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བརྒྱད་ཅུ་དག་གི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will remain For eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་གསུམ་པ་རིན་ཆེན་མང་པོས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa Measuring three leagues and studded with numerous jewels.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་ཅིང་བཀུར་ཞེས་བྱ། །
en: “The thus-gone Tejasprabha Will be born in a place called Worshiped and Venerated.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་ལེགས་རྒལ་ཡིན། །ཡོན་ཏན་བརྒྱན་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of the victor will be brahmin And his light will extend six leagues. “Excellent Crossing will be his father and Adorned with Qualities will be this victor’s mother.

source: སྲས་པོ་མཁས་ལྡན་སྣང་ལྡན་རིམ་གྲོ་པ། །
en: Expert will be his son and Luminous his attendant.

source: སྲིད་པའི་འཆིང་བ་གཅོད་བྱེད་མཁས་པ་སྟེ། །
en: Severer of the Bonds of Existence will be the scholar

source: སྲིད་པ་འཇོམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Crusher of Existence the one of miracles.

source: འདུས་པ་ལན་གྲངས་དག་ནི་བརྒྱ་ཡིན་ཏེ། །བསོད་ནམས་རྣམ་གྲོལ་དགྲ་བཅོམ་མི་སློབ་པ། །དེ་དག་འདུས་པ་ཐེར་འབུམ་ཚང་བར་ཡོད། །
en: “There will be one hundred consecutive congregations, Each of them gathering a full billion worthy ones who are endowed with merit and liberation And have reached the level of no more training.

source: དམ་ཆོས་ལོ་གྲངས་བྱེ་བར་གནས་འགྱུར་ཞིང་། །
en: “And the sacred Dharma will remain for ten million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་ཕྲག་གསུམ་སྟེ། །རྣམ་རྒྱལ་ཁང་བཟངས་ལྟ་བུར་ལེགས་པར་སྤྲས། །
en: The relics of this victor will be abundant, And the stūpas, numbering three billion, Will be exquisitely decorated, like the Palace of Victory.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཆོས་ཀྱི་འོད་ཅེས་བྱ། །
en: “The thus-gone Mahāraśmi Will be born in a place called Dharma Light.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་བདག་ཉིད་ཆེན་པོ་ཡབ། །སེམས་མཚུངས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy-two leagues. “Great Being will be his father and Equal Mind will be this victor’s mother.

source: སྲས་པོ་འོད་ལྡན་ངེས་ལྡན་རིམ་གྲོ་པ། །
en: Luminous will be his son and Endowed with Certainty his attendant.

source: ཤིན་ཏུ་རྣམ་པར་ངེས་པ་མཁས་པ་སྟེ། །
en: Thorough Ascertainment will be the scholar

source: ངེས་ཐོབ་ཅེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Attainer of Certainty the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བཅུ་བཞི་སྟེ། །ཀུན་ལའང་དགྲ་བཅོམ་པ་ཡི་ཚོགས་དག་གི། །མཚུངས་པར་འགྱུར་ཏེ་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: “There will be fourteen consecutive congregations, Each of them gathering one billion Who are all at the level of a worthy one.

source: བདུད་རྣམས་ཕུང་བར་མཛད་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this vanquisher of the hordes of the māras Will remain for ninety-nine thousand years.

source: སྟོན་པ་མྱ་ངན་འདས་ནས་རྒྱལ་བ་ཡི། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱ་པ་གཅིག །
en: When this victorious teacher has attained nirvāṇa His relics will reside in a stūpa that is one hundred leagues large.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Ratnayaśas will be born in a place called Jewel Crest.

source: འོད་ནི་སྟོང་གསུམ་ཙམ་མོ། །
en: His light will extend the breadth of a trichiliocosm.

source: ཡབ་ནི་འགྲོ་བའི་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Lord of Beings will be his father.

source: ཡུམ་ནི་དཔལ་གྱི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Glorious Jewel will be his mother.

source: སྲས་ནི་ཡོན་ཏན་སྟོང་གི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of a Thousand Qualities will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གྱི་ཚོགས་ཞེས་བྱའོ། །
en: Gathering of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་ཟེར་ཡིད་དུ་འོང་བ་ཞེས་བྱའོ། །
en: Beautiful Light Rays will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་གྲངས་གྲངས་མེད་དེ། ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་གོ། །
en: There will be infinitely many congregations, all of them consisting of irreversible bodhisattvas.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཁྲི་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for three trillion six hundred billion years.

source: སྐུ་གདུང་ནི་རྒྱས་པར་འགྱུར་རོ། །མཆོད་རྟེན་ནི་སུམ་འབུམ་མོ། །
en: His relics will be abundant, and there will be three hundred thousand stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཚོགས་ཅན་གསལ་བ་སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: “The thus-gone Gaṇiprabhāsa will be born in a place called Ocean of Intelligence.

source: ཡུམ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Delightful Melody will be his mother.

source: སྲས་ནི་སེང་གེས་རྣམ་པར་རྩེ་ཞེས་བྱའོ། །
en: Playful Lion will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Lamp of Fame will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རོ་མཆོག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Supreme Taste will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་དང་པོ་ནི་ཐེར་འབུམ་ཕྲག་གསུམ་མོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་ལྔའོ། །
en: In the first congregation there will be three billion hearers, in the second there will be four billion, and in the third there will be five billion.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་མཐའ་ཡས་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཞེས་བྱའོ། །
en: “The thus-gone Anantayaśas will be born in a place called Delightful Melody.

source: འོད་ནི་དཔག་ཚད་གཉིས་སོ། །
en: His light will extend two leagues.

source: ཡུམ་ནི་རྒྱུ་སྐར་བདག་མོ་ཞེས་བྱའོ། །
en: Lady of the Stars will be his mother.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་འབྱོར་ལྡན་ཞེས་བྱའོ། །
en: Endowed with Meritorious Wealth will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསྒོམས་པའི་བདག་ཉིད་ཅན་ཞེས་བྱའོ། །
en: Endowed with the Nature of Meditation will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Merit Splendor will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དོན་ཡོད་སྐྱེ་བའི་ཡུལ་ནི་དོན་ཡོད་སྟེགས་ཞེས་བྱའོ། །
en: “The thus-gone Amogharaśmi will be born in a place called Meaningful Steps.

source: ཡབ་ནི་ཁ་དོག་བྱིན་ཞེས་བྱའོ། །
en: Gift of Colors will be his father.

source: ཡུམ་ནི་དགའ་བས་ལྟ་ཞེས་བྱའོ། །
en: Looking with Joy will be his mother.

source: སྲས་ནི་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱའོ། །
en: Universally Good will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁ་ལོ་སྒྱུར་བའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Leaders will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་སྤངས་ཞེས་བྱའོ། །
en: Free from Māras will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be six consecutive congregations of worthy ones, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་དྲང་སྲོང་སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ṛṣideva will be born in a place called Fully Blooming.

source: འོད་ནི་དཔག་ཚད་ཕྱེད་དང་གཉིས་སོ། །
en: His light will extend two and a half leagues.

source: ཡབ་ནི་དྲང་སྲོང་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Sage Friend will be his father.

source: ཡུམ་ནི་ཕྱོགས་གནས་མ་ཞེས་བྱའོ། །
en: Abiding by the Position will be his mother.

source: སྲས་ནི་སྤོས་མཆོག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Supreme Fragrance will be his son.

source: རིམ་གྲོ་པ་ནི་ཤིན་ཏུ་འབྱོར་པ་ཞེས་བྱའོ། །
en: Perfectly Endowed will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱའོ། །
en: Blooming Flowers of Superknowledge will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁྱད་པར་དུ་འཕགས་པའི་བློ་ཞེས་བྱའོ། །
en: Superior Wisdom will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་གཉིས་ཏེ། གཉིས་ཀ་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be two consecutive congregations of worthy ones, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་བའི་དབང་པོ་སྐྱེ་བའི་ཡུལ་ནི་སྐྱེ་བོ་དགའ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Janendra will be born in a place called Delighting People.

source: ཡབ་ནི་ཟླ་རྒྱས་ཞེས་བྱའོ། །
en: Full Moon will be his father.

source: ཡུམ་ནི་རྒྱལ་དཀའ་མ་ཞེས་བྱའོ། །
en: Victorious Austerities will be his mother.

source: སྲས་ནི་འཁྲུལ་པ་མེད་པར་སེམས་ཞེས་བྱའོ། །
en: Mind without Delusion will be his son.

source: རིམ་གྲོ་པ་ནི་ཁྱད་པར་སེམས་ཞེས་བྱའོ། །
en: Special Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་འཇོམས་ཞེས་བྱའོ། །
en: Māra Crusher will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་གཉིས་སྤོང་ཞེས་བྱའོ། །
en: Abandoning Doubt will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be five consecutive congregations of worthy ones, each of them gathering ten thousand.

source: དེ་བཞིན་གཤེགས་པ་དགེ་འདུན་བརྟན་སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་བརྟན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Dṛḍhasaṅgha will be born in a place called Stable Intelligence.

source: ཡུམ་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel will be his mother.

source: སྲས་ནི་ལྷས་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by Gods will be his son.

source: རིམ་གྲོ་པ་ནི་འགྲོ་བ་ལྟ་ཞེས་བྱའོ། །
en: Observing the World will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་དྲག་ཤུལ་ཅན་ཞེས་བྱའོ། །
en: Possessor of Fierce Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཉམ་ཉིད་གནས་ཞེས་བྱའོ། །
en: Abiding in Equality will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་གཅིག་ཏུ་ཟད་དེ། དགྲ་བཅོམ་པ་སུམ་འབུམ་མོ། །
en: There will be just a single congregation, gathering three hundred thousand worthy ones.

source: དེ་བཞིན་གཤེགས་པ་ཕྱོགས་བཟངས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་ངོས་ཞེས་བྱའོ། །
en: “The thus-gone Supakṣa will be born in a place called Jewel Facets.

source: འོད་ནི་དཔག་ཚད་བདུན་བརྒྱའོ། །
en: His light will extend seven hundred leagues.

source: ཡབ་ནི་དབྱིག་གི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Gem Radiance will be his father.

source: ཡུམ་ནི་ཡིད་དུ་འོང་བས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Beauty will be his mother.

source: སྲས་ནི་དོན་ཡོད་དགའ་ཞེས་བྱའོ། །
en: Meaningful Joy will be his son.

source: རིམ་གྲོ་པ་ནི་སྐར་མདའ་འདོད་ཅེས་བྱའོ། །
en: Meteor Wish will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཁྱད་པར་དུ་འཕགས་པའི་བློ་ཞེས་བྱའོ། །
en: Superior Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགྲ་བཅོམ་གྲགས་པ་ཞེས་བྱའོ། །
en: Fame of the Worthy will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ལྔ་ལྔའོ། །
en: There will be twenty-nine consecutive congregations of worthy ones, each of them gathering fifty million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཁྲི་ཆིག་སྟོང་ངོ་། །
en: The extent of his lifespan will be eleven thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཁྲི་ཆིག་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for eleven thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་ཏོག་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Ketu will be born in a place called Supreme Crest.

source: ཡབ་ནི་གཞལ་མེད་མཆོག་ཅེས་བྱའོ། །
en: Supreme Immeasurability will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་ལྟ་ཞེས་བྱའོ། །
en: Viewing Qualities will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡང་སྲིད་ཐུལ་ཞེས་བྱའོ། །
en: Tamer of Rebirths will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟག་པ་མེད་པའི་སེམས་ཞེས་བྱའོ། །
en: Undefiled Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགོག་པ་ཐོབ་ཅེས་བྱའོ། །
en: Cessation Attained will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་བཞིའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་གོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: In the first congregation there will be four hundred million worthy ones, in the second there will be six hundred million, and in the third there will be one billion.

source: སྐུ་གདུང་ནི་རྒྱས་པར་འགྱུར་རོ། །མཆོད་རྟེན་ནི་བརྒྱད་ཁྲི་འབྱུང་ངོ་། །
en: His relics will be abundant, and there will be eighty thousand stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་མེ་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་གྱིས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Kusumarāṣṭra will be born in a place called Adorned with Qualities.

source: ཡབ་ནི་བསོད་ནམས་དཔལ་ཞེས་བྱའོ། །
en: Glorious Merit will be his father.

source: ཡུམ་ནི་མེ་ཏོག་བྱིན་ཞེས་བྱའོ། །
en: Flower Gift will be his mother.

source: སྲས་ནི་པད་མ་དཀར་པོ་ཞེས་བྱའོ། །
en: White Lotus will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲོགས་ཐུལ་ཞེས་བྱའོ། །
en: Tamer of Companions will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཞན་གྱིས་མི་ཐུབ་པའི་མཐུ་ཞེས་བྱའོ། །
en: Indomitable Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be sixteen consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་བློ་གྲོས་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་འདབ་བཟངས་ཞེས་བྱའོ། །
en: “The thus-gone Dharmamati will be born in the city of Fine Petals.

source: ཡབ་ནི་ཚངས་པ་སེམས་ཞེས་བྱའོ། །
en: Brahmā Mind will be his father.

source: ཡུམ་ནི་བསམ་པས་བྱིན་ཞེས་བྱའོ། །
en: Intentional Gift will be his mother.

source: སྲས་ནི་ནོར་དགའ་ཞེས་བྱའོ། །
en: Happy Wealth will be his son.

source: རིམ་གྲོ་པ་ནི་ཤིན་ཏུ་དགེ་ཞེས་བྱའོ། །
en: Extremely Virtuous will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླས་བྱིན་དབྱངས་ཞེས་བྱའོ། །
en: Moon Gift Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཞི་བས་བྱིན་ཞེས་བྱའོ། །
en: Gift of Peace will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་རོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་མོ། །
en: In the first congregation there will be one billion hearers, in the second there will be one hundred million, and in the third there will be three hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་དགུ་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-nine thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་དྲུག་ཁྲི་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for sixty-nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་རླུང་གི་ཤུགས་ལྟར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་ཤིན་ཏུ་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Anilavegagāmin will be born in a place called Thoroughly Abiding.

source: ཡབ་ནི་མི་འཐུན་པ་མེད་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind without Discord will be his father.

source: ཡུམ་ནི་ཐར་པ་དད་ཅེས་བྱའོ། །
en: Liberation Faith will be his mother.

source: སྲས་ནི་བེའུ་དགའ་ཞེས་བྱའོ། །
en: Knot of Joy will be his son.

source: རིམ་གྲོ་པ་ནི་མེ་ཏོག་མྱ་ངན་འཚང་ཞེས་བྱའོ། །
en: Pain Extracting Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་ཏོག་མན་དཱ་ར་བའི་དྲི་ཞེས་བྱའོ། །
en: Mandārava Fragrance will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཙན་དན་འོད་ཅེས་བྱའོ། །
en: Sandalwood Light will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། །ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སྟོང་སྟོང་ངོ་། །
en: There will be ninety consecutive congregations of hearers, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་བསམས་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་ཆེན་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Sucittayaśas will be born in a place called Great Array.

source: ཡབ་ནི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor will be his father.

source: སྲས་ནི་རླུང་སེམས་ཞེས་བྱའོ། །
en: Wind Mind will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་སྙོམས་ཞེས་བྱའོ། །
en: Equanimous Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཚོགས་གསལ་ཞེས་བྱའོ། །
en: Clear Gathering will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཞན་གྱིས་མི་ཐུབ་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Indomitable Intelligence will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be fourteen consecutive congregations of hearers, each of them gathering one hundred thousand.

source: དམ་པའི་ཆོས་ནི་ལོ་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventeen thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྣང་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་སྐར་མའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Dyutimat will be born in a place called Starlight.

source: ཡབ་ནི་གློག་གིས་བྱིན་ཞེས་བྱའོ། །
en: Given by Lightning will be his father.

source: སྲས་ནི་མཆོད་དགའ་ཞེས་བྱའོ། །
en: Joyous Worship will be his son.

source: རིམ་གྲོ་པ་ནི་དོན་མཐོང་ཞེས་བྱའོ། །
en: Seeing the Meaning will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་མཐོང་ཞེས་བྱའོ། །
en: Seeing the Truth will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་དགའ་ཞེས་བྱའོ། །
en: Joyous Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་སུམ་ཅུ་སུམ་ཅུའོ། །
en: There will be eight consecutive congregations, each of them gathering thirty billion.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་ཚོགས་སྐྱེ་བའི་ཡུལ་ནི་མཚོན་ཆ་བཟང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Marutskandha will be born in a place called Excellent Weapon.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་བརྒྱའོ། །
en: His light will extend eight hundred leagues.

source: ཡབ་ནི་ལྷ་མ་ཡིན་གྱི་ལྷ་ཞེས་བྱའོ། །
en: God of Demigods will be his father.

source: ཡུམ་ནི་ཀླུ་འོད་མ་ཞེས་བྱའོ། །
en: Nāga Light will be his mother.

source: སྲས་ནི་གཙོ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Leader will be his son.

source: རིམ་གྲོ་པ་ནི་ཏོག་འཕགས་ཞེས་བྱའོ། །
en: Superior Crest will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀླུ་དབང་གྲགས་ཞེས་བྱའོ། །
en: Fame of the Nāga Master will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་གཏོང་ཞེས་བྱའོ། །
en: Jewel Giving will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །
en: In the first congregation there will be one billion hearers, in the second there will be one hundred fifty million, and in the third there will be nine hundred million.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་བསྲུངས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Guṇagupta will be born in a place called Endowed with Qualities.

source: ཡབ་ནི་ཡོན་ཏན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Qualities will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་དཔལ་ཞེས་བྱའོ། །
en: Glorious Qualities will be his mother.

source: སྲས་ནི་རིན་ཆེན་མཆོད་ཅེས་བྱའོ། །
en: Precious Worship will be his son.

source: རིམ་གྲོ་པ་ནི་མངོན་པར་དགའ་ཞེས་བྱའོ། །
en: True Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལེགས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Excellent Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བླ་མ་ཞེས་བྱའོ། །
en: Highest will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བཅུ་གསུམ་བཅུ་གསུམ་མོ། །
en: There will be fourteen consecutive congregations, each of them gathering one billion three hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be twenty-three thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲིའི་བར་དུ་གནས་སོ། །སྐུ་གདུང་ནི་རིལ་པོ་གཅིག་ཏུ་འདུག་གོ། །
en: His sacred Dharma will remain for eighty thousand years. His relics will remain in a single collection.

source: དེ་བཞིན་གཤེགས་པ་དོན་གྱི་བློ་གྲོས་སྐྱེ་བའི་ཡུལ་ནི་ཆོས་གསལ་ཞེས་བྱའོ། །
en: “The thus-gone Arthamati will be born in a place called Clear Dharma.

source: འོད་ནི་དཔག་ཚད་བཞི་ཁྲི་བཞི་སྟོང་ངོ་། །
en: His light will extend forty-four thousand leagues.

source: ཡབ་ནི་མེ་ཏོག་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Flower King will be his father.

source: སྲས་ནི་པད་མ་ཅན་ཞེས་བྱའོ། །
en: Lotus Possessor will be his son.

source: རིམ་གྲོ་པ་ནི་ལེགས་སྐྱེས་ཞེས་བྱའོ། །
en: Excellent Birth will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་གནས་པའི་བློ་ཞེས་བྱའོ། །
en: Nonabiding Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲང་སྲོང་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Sages will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་དགུ་སྟེ། ཐམས་ཅད་ལ་ཡང་སྟོང་ཕྲག་བཅུ་གསུམ་བཅུ་གསུམ་མོ། །
en: There will be twenty-nine consecutive congregations, each of them gathering thirteen thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དགུ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for nine thousand years.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་མེད་སྐྱེ་བའི་ཡུལ་ནི་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Abhaya will be born in a place called Indomitable.

source: ཡུམ་ནི་ལེགས་བསམས་གྲགས་མ་ཞེས་བྱའོ། །
en: Renowned Excellent Intention will be his mother.
